{"license":"","file_hash":null,"name":"RIE","version":"0.5.0","description":"RIE Package for MEP Electrical, designed for internal usage at Norconsult AS","group":"310","keywords":["mep","electrical","rie","electro"],"dependencies":[],"contents":"RIE.BatchIFC - Forked from Bakery. Modified to work with view inputs.\r\n\r\nInput directory path and 3D view prefix., RIE.BboxFromBboxString - Can convert BoundingBox list element that has been converted to string back to a BoundingBox, RIE.BCFZipReader - Reads contents of BCFzip. Adjusted for use in Norconsult. Input directorypath of unzipped BCFzip folder., RIE.BoundingBox.Expand - Expands the input boundingbox by given input amount, RIE.BoundingBoxBy3DView - Outputs the boundingbox of input 3D view, RIE.ChamferedWire - Input from and to element, with connection points and vertices in order. Input wire type as well., RIE.ClosestPointByTwoListsOfPoints - Finds each \"points1\" closest \"points2\", RIE.CopyElementsFromViewToView - Copies elements from view to view., RIE.CopyViewRangeFromViewToView - Copy view range from views to views., RIE.CreatePanelSchedule - Creates PanelSchedule from input Panel elements. Uses default Template if no template is input., RIE.CreateSheets - Create sheets with inputs; Sheet Name, Number and Titleblock, RIE.DeconstructPoint - Deconstructs points into their X, Y and Z values. Idea stolen from Lunchbox's equivalent node., RIE.DrawLinesToNearbyPoints - Input Two lists of points and from each point in list 1 there will be drawn a line to each point in list 2 which is closer than the input value in list 3, RIE.DrawWires - Draws wires for the Electrical System in the input view., RIE.DropNthItemInSublists - Input list of indexes to be dropped from each sublist., RIE.Element.SpaceAndRoom - Gets the Spaces and Rooms containing the input  list of Elements, RIE.ElementsByView - Selects elements that are visible in input view. Forked from Marc, RIE.ElementsOfCategoryByView - Retrieves all elements of an input category in input views., RIE.ExportCurvesToAutoCAD - Forked from LinkDWG package, RIE.FilterOutBusyElements - Filters out elements that are borrowed by other localfile users., RIE.GetAllViewTemplates - Gets all view templates. Forked from SpringNodes, RIE.GetCategoriesContainingString - Gets all categories in project that contains input string, RIE.GetCircuitFromPanelScheduleView - Input PanelScheduleView Element, and input integervalue of circuit., RIE.GetElementConnector - No description provided, RIE.GetImportInstancesInView - Gets Imported instances like CAD links in input view., RIE.GetPanelAndEquipmentFromCircuit - Gets panel circuit is connected to, and Elements connected to the circuit., RIE.GetPanelFromPanelScheduleView - Gets The panel corresponding to the input PanelScheduleView, RIE.GetPanelScheduleViews - Gets Panel Schedules Views, RIE.GraphicOverrideElementsInViews - Overrides elements in views with input color for both lines and fill. Requires you to have a fill pattern named \"Solid fill\", RIE.If - An If node that keeps list structure, empty lists and so forth., RIE.IndexDuplicateStrings - Indexes input list of strings with a running index for each set of duplicates, RIE.IndexOf - Returns a sublistlist with all indexes for each item., RIE.InsertItemAtIndex - Inserts Items into list at given index, RIE.IntersectionsFromListOfLines - Outputs points on which lines in a list intersect, RIE.LinkedElementCategory - Returns Category of Linked Element, RIE.LinkedElementsByElementID - Get linked elements by element ID and link instance, RIE.LinkedFamilyType - Returns FamilyType for linked elements., RIE.Math.MRound - Rounds given numbers to nearest input multiple, RIE.MoveCircuit - Moves Circuitnumber To input circuit number row. New Circuit number row has to be unoccupied., RIE.MoveCircuitToFirstOpen - Moves input circuit to first open in input starting series., RIE.Orient3DViewToSelectedFace - Orients the active 3D view to the selected face. First select the element or link you want to select a reference face from, then select the face., RIE.PlaceViewOnSheet - Places Views, Schedules or Legends into sheets., RIE.Point.SpaceAndRoom - Gets Spaces and Rooms containing the point from the input points list., RIE.PowerElements - Powers list of elements, RIE.ReplaceItemsAtIndices - Replaces items at indices with input value. One value for each index needed., RIE.ResetGraphicOverrideElementsInViews - Resets Graphic overrides for all input elements in all input views., RIE.SelectElementById - Forked from Clockwork, RIE.SelectLinkedElement - Prompts you to select link, then select linked element. Returns Link element instnace, Link instance and Link Transform., RIE.SelectPanel - Assigns Electrical System (cirucit) to a panel and assigns the circuit an automatic running index number, RIE.Set3DViewSectionBox - Sets sectionbox of 3D view and if the view is open, also zooms to its extents., RIE.SetRevitSelection - Input elements to select in Revit model, RIE.SpaceBoundaryLines - Outputs Boundarylines of input Space elements, RIE.TagsReconcileHosting - Runs the ReconcileHosting Postable Command in the Revit UI, and represents a report of orphaned tags that needs to be looked at., RIE.TimeRightNow - Uses time module from python to get current time., RIE.ViewType - Outputs the type of view input to the node, RIE.WaitFor - Waits for \"GO input\" before passing through main input, RIE.WorksharingInfo - Gets Worksharing Info Tooltip from Elements ., RIE.WorksharingInfoFromLink - Gets worksharing info from input link instance and elementset, RIE.zfill - zfills input string with input amount of characters.","engine_version":"1.3.3.4111","engine":"dynamo","engine_metadata":"","site_url":"","repository_url":"","contains_binaries":true,"node_libraries":[]}